# Core CLI tools
brew "curl"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "jq"
brew "stow"
brew "tmux"

# Shell
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Containers
brew "colima", restart_service: :changed
brew "docker"
brew "docker-compose"

# GPG
brew "pinentry-mac"

# Casks
cask "font-fira-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
