# ── Core CLI ─────────────────────────────────────────────────────────────────
brew "git"
brew "git-lfs"
brew "git-delta"         # beautiful git diffs with syntax highlighting
brew "gh"                # GitHub CLI
brew "gnupg"
brew "jq"
brew "yq"                # jq for YAML/TOML/XML
brew "stow"
brew "tmux"
brew "tree"

# ── Shell ────────────────────────────────────────────────────────────────────
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "fzf"               # fuzzy finder (Ctrl-R history, Ctrl-T files)
brew "zoxide"            # smarter cd that learns your directories
brew "direnv"            # auto-load .envrc per directory

# ── Modern Replacements ──────────────────────────────────────────────────────
brew "eza"               # modern ls with git integration & icons
brew "bat"               # cat with syntax highlighting
brew "fd"                # simple, fast find alternative
brew "ripgrep"           # blazing fast grep replacement
brew "dust"              # intuitive du replacement
brew "duf"               # modern df with color output
brew "btop"              # polished resource monitor

# ── Containers ───────────────────────────────────────────────────────────────
brew "colima", restart_service: :changed
brew "docker"
brew "docker-compose"
brew "lazygit"           # terminal UI for git
brew "lazydocker"        # terminal UI for docker

# ── Security ─────────────────────────────────────────────────────────────────
brew "pinentry-mac"
brew "age"               # modern file encryption
brew "gitleaks"          # scan for accidentally committed secrets

# ── Network ──────────────────────────────────────────────────────────────────
brew "xh"                # modern httpie (API testing)
brew "wget"

# ── Casks ────────────────────────────────────────────────────────────────────
cask "font-fira-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
