tap "dart-lang/dart"
tap "leoafarias/fvm"
tap "localstack/tap"
brew "xz"
brew "openssl@3"
brew "autoconf"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bzip2"
brew "cloc"
brew "cmake"
brew "colima", restart_service: :changed
brew "coreutils"
brew "cryptography"
brew "curl"
brew "docker"
brew "docker-compose"
brew "docutils"
brew "unbound"
brew "icu4c@77"
brew "harfbuzz"
brew "libass"
brew "librist"
brew "ffmpeg"
brew "freetds"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "go-task"
brew "golangci-lint"
brew "gzip"
brew "imagemagick"
brew "jq"
brew "libedit"
brew "libiconv"
brew "libyaml"
brew "log4cplus"
brew "mysql"
brew "openblas"
brew "openjdk@11"
brew "tidy-html5"
brew "php@8.3", link: true
brew "pinentry-mac"
brew "pkgconf"
brew "starship"
brew "stow"
brew "tmux"
brew "tnftp"
brew "unzip"
brew "leoafarias/fvm/fvm"
brew "localstack/tap/localstack-cli"
cask "alacritty"
cask "cyberduck"
cask "dbeaver-community"
cask "google-chrome"
cask "karabiner-elements"
cask "medis"
cask "postman"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "zed"
